In [1]:
import numpy as np 
import pandas as pd

In [2]:
  dict1={
      "name":['harry','rohan','skillf','shubh'],
      "marks":[92,34,12,76],
      "city":['kolkata','delhi','mumbai','aurangabad']      #sample data.
        }

In [3]:
df = pd.DataFrame(dict1)  #this will make a dataframe. this will convert the data to excel sheet for faster indexing.

In [4]:
print(df) #index,name,marks,column

     name  marks        city
0   harry     92     kolkata
1   rohan     34       delhi
2  skillf     12      mumbai
3   shubh     76  aurangabad

In [5]:
df.to_csv('friends.csv') #will covert the data to a csv(excel) file.

In [6]:
df.to_csv('friends_indexFalse.csv',index=False) #same,but no indexing now in excel

In [7]:
df.head(2) #will show the first two entries.

    name  marks     city
0  harry     92  kolkata
1  rohan     34    delhi

In [8]:
df.tail(2) #will show the last two

     name  marks        city
2  skillf     12      mumbai
3   shubh     76  aurangabad

In [9]:
df.describe() # Will calcculate the standard deviation,mean etc of all the numerical values.

           marks
count   4.000000
mean   53.500000
std    36.927858
min    12.000000
25%    28.500000
50%    55.000000
75%    80.000000
max    92.000000

In [10]:
newton=pd.read_csv('Newtan.csv') #read from csv file.

In [11]:
newton['distance'][1]=40

C:\Users\Newtan\AppData\Local\Temp/ipykernel_580/3974474628.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newton['distance'][1]=40

In [12]:
newton

  surname  distance        area
0   harry        92     kolkata
1   rohan        40       delhi
2  skillf        12      mumbai
3   shubh        76  aurangabad

In [13]:
newton.to_csv('Newtan.csv',index=False)

# change index title to something else

In [14]:
newton.index=['first','second','third','fourth']

# Use of numpy to make the dataframe

In [15]:
newdf=pd.DataFrame(np.random.rand(336,5),index=np.arange(336))

In [16]:
type(newdf)

pandas.core.frame.DataFrame

In [17]:
newdf.describe()

                0           1           2           3           4
count  336.000000  336.000000  336.000000  336.000000  336.000000
mean     0.498925    0.507859    0.494279    0.498344    0.491417
std      0.289994    0.276719    0.288414    0.300556    0.276596
min      0.004893    0.013637    0.000217    0.001528    0.005530
25%      0.234389    0.281168    0.242702    0.237848    0.258174
50%      0.495053    0.504636    0.493727    0.498031    0.484008
75%      0.768228    0.734081    0.736346    0.777754    0.722054
max      0.999201    0.994986    0.996829    0.998116    0.997457

In [18]:
newdf=newdf.rename(columns={'new':'newton'}) # Rename the column name to something else.

In [19]:
newdf.head()

          0         1         2         3         4
0  0.767778  0.241591  0.296931  0.284010  0.067540
1  0.446068  0.522179  0.601631  0.690122  0.204458
2  0.886178  0.765795  0.012818  0.798014  0.710430
3  0.232437  0.882036  0.005848  0.049907  0.471830
4  0.518885  0.140367  0.017592  0.318646  0.914320

In [20]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [21]:
newdf.columns

Int64Index([0, 1, 2, 3, 4], dtype='int64')

# converting from dataframe tio numpy format

In [22]:
newdf[0][0]=0.73
newdf.to_numpy()

array([[0.73      , 0.24159065, 0.2969313 , 0.28400978, 0.06753953],
       [0.44606816, 0.52217873, 0.60163129, 0.69012165, 0.20445765],
       [0.88617827, 0.76579544, 0.01281817, 0.79801429, 0.71043021],
       ...,
       [0.14639521, 0.20702834, 0.17515602, 0.41535088, 0.58118582],
       [0.67764925, 0.81288429, 0.10774448, 0.95754389, 0.15602216],
       [0.79738035, 0.84405664, 0.33079582, 0.5115173 , 0.60895176]])

In [23]:
newdf.T #Transpose

,0,1,2,3,4,5,6,7,8,9,...,326,327,328,329,330,331,332,333,334,335
0,0.730000,0.446068,0.886178,0.232437,0.518885,0.503175,0.271156,0.171074,0.953264,0.153660,...,0.592394,0.689292,0.060048,0.113983,0.641967,0.229551,0.425449,0.146395,0.677649,0.797380
1,0.241591,0.522179,0.765795,0.882036,0.140367,0.920762,0.040733,0.375286,0.535862,0.272115,...,0.487359,0.747437,0.719526,0.475674,0.854431,0.727212,0.842604,0.207028,0.812884,0.844057
2,0.296931,0.601631,0.012818,0.005848,0.017592,0.439297,0.308010,0.781561,0.548578,0.343950,...,0.702614,0.245642,0.593557,0.660040,0.773022,0.834526,0.942080,0.175156,0.107744,0.330796
3,0.284010,0.690122,0.798014,0.049907,0.318646,0.539841,0.772812,0.186648,0.631908,0.001528,...,0.866633,0.027820,0.873194,0.194507,0.050308,0.405028,0.432118,0.415351,0.957544,0.511517
4,0.067540,0.204458,0.710430,0.471830,0.914320,0.684698,0.555042,0.386414,0.859180,0.997457,...,0.043507,0.164416,0.234176,0.125694,0.340698,0.105927,0.320015,0.581186,0.156022,0.608952

In [24]:
newdf.sort_index(axis=0,ascending=False) #Sort the table on the basis of decreasing values of their index.

            0         1         2         3         4
335  0.797380  0.844057  0.330796  0.511517  0.608952
334  0.677649  0.812884  0.107744  0.957544  0.156022
333  0.146395  0.207028  0.175156  0.415351  0.581186
332  0.425449  0.842604  0.942080  0.432118  0.320015
331  0.229551  0.727212  0.834526  0.405028  0.105927
..        ...       ...       ...       ...       ...
4    0.518885  0.140367  0.017592  0.318646  0.914320
3    0.232437  0.882036  0.005848  0.049907  0.471830
2    0.886178  0.765795  0.012818  0.798014  0.710430
1    0.446068  0.522179  0.601631  0.690122  0.204458
0    0.730000  0.241591  0.296931  0.284010  0.067540

[336 rows x 5 columns]

# Copy,View

In [25]:
x=newdf.copy()
x[1][0]=1.45

In [26]:
x.columns=list("qwert") # q for first column,w for second and so on.

# Drop rows/columns

In [27]:
x.drop('t',axis=1) #this will drop the column 't'.
x.drop(0,axis=0) #this will drop the row 0.

#Note:These drops will be locally made. to assign it, do x=x.drop()...

            q         w         e         r         t
1    0.446068  0.522179  0.601631  0.690122  0.204458
2    0.886178  0.765795  0.012818  0.798014  0.710430
3    0.232437  0.882036  0.005848  0.049907  0.471830
4    0.518885  0.140367  0.017592  0.318646  0.914320
5    0.503175  0.920762  0.439297  0.539841  0.684698
..        ...       ...       ...       ...       ...
331  0.229551  0.727212  0.834526  0.405028  0.105927
332  0.425449  0.842604  0.942080  0.432118  0.320015
333  0.146395  0.207028  0.175156  0.415351  0.581186
334  0.677649  0.812884  0.107744  0.957544  0.156022
335  0.797380  0.844057  0.330796  0.511517  0.608952

[335 rows x 5 columns]

In [28]:
x['new']=np.arange(336) # add a new column of values from 0,1,2,3....335

# Get the rows/column indexes

In [29]:
print(x.loc[[2,4,9,5],['w','q','e' ]])
print(x.loc[[2,4,9,5],:])

          w         q         e
2  0.765795  0.886178  0.012818
4  0.140367  0.518885  0.017592
9  0.272115  0.153660  0.343950
5  0.920762  0.503175  0.439297
          q         w         e         r         t  new
2  0.886178  0.765795  0.012818  0.798014  0.710430    2
4  0.518885  0.140367  0.017592  0.318646  0.914320    4
9  0.153660  0.272115  0.343950  0.001528  0.997457    9
5  0.503175  0.920762  0.439297  0.539841  0.684698    5

# Conditional data fetch

In [32]:
x.loc[(x['w']>0.6) & (x['e']>0.6)]['new'][22]
# fetch the entry in the index number 4 in the table where the column is new,and where the table actually has the w values greater than 0.6

22

In [33]:
x.iloc[[1,5,17],[0,1,3]] 
#iloc is used when we dont want to input the column by its name, but rather simply by indexing.

           q         w         r
1   0.446068  0.522179  0.690122
5   0.503175  0.920762  0.539841
17  0.281841  0.366958  0.859746

In [35]:
new=x.loc[(x['w']>0.6) & (x['e']>0.6)]

In [42]:
new.reset_index(drop=True,inplace=True) # This function will basically ensure that the indexing starts from 0.
new.head()

          q         w         e         r         t  new
0  0.607913  0.970597  0.934600  0.639065  0.352757   16
1  0.512904  0.881182  0.768209  0.055210  0.267391   22
2  0.543605  0.605938  0.660468  0.399607  0.475081   30
3  0.724988  0.831216  0.625884  0.849870  0.522436   45
4  0.278844  0.714820  0.963685  0.156041  0.488221   48

# Null

In [43]:
new['q'].isnull()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
51    False
52    False
53    False
54    False
55    False
56    False
Name: q, dtype: bool

In [46]:
new.loc[:,['w']]=None #Always use this instead of just doing new['w']= None

In [47]:
new['w'].isnull()

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
29    True
30    True
31    True
32    True
33    True
34    True
35    True
36    True
37    True
38    True
39    True
40    True
41    True
42    True
43    True
44    True
45    True
46    True
47    True
48    True
49    True
50    True
51    True
52    True
53    True
54    True
55    True
56    True
Name: w, dtype: bool

In [50]:
new.dropna() # locally. this will eliminate all rows where even one na is there

Empty DataFrame
Columns: [q, w, e, r, t, new]
Index: []